/*
let num = 50;

if(num < 49) {
alert('Мало');
} else if(num > 100) {
alert('Дохуя');
} else {
alert('Верно!');
}

(num == 50) ? alert('Верно!') : alert('Мало');

switch(num) {
  case num < 49:
  alert('Мало');
  break;
  case num > 100:
  alert('Дохуя');
  break;
  case num > 80:
  alert('Все еще много');
  break;
  case 50:
  alert('Верно!');
  break;
  default:
  alert('Что-то пошло не так!');
  break;
}

*/

/*
JS Конспект

Условия
if vs else if
else if = в противном случае (Если первое условие не сработало)
Если мы используем несколько if, то все они сработают.
Если мы используем if + else if, то только одно из условий сработает (второе не смотрим)

Тернарный оператор ? (Всмысле тройной, три условия)
Формула :
условие ? код(выполнится если условие верно) : код(который выполнится если условие не верно)
(num == 50) ? alert('Верно!') : alert('Мало');
Тернарных операторов может быть много :
2 > 1 ? (3 > 4 ? 'v1' : 'v2') : (4 > 2 ? 'v3' : 'v4');

Switch Case
break - отгораживаем одно условие от другого
Вместо num == 50 / case 50 :



*/
